print('привет пройди квест про жизнь')
a = input('выбери страну россия или америка ')
if a == 'америка':
    print('ты выжил')
    z = input('цвет кожи белый или черный ')
    if z == 'белый':
        print('ты выжил')
        b = input('выбери имя ')
        if b == 'артем':
            print('ты выжил')
            c = input('выбери професию ')
            if c == 'программист':
                print('ты выжил')
                x = input('выбери пол муж жен ')
                if x == 'муж':
                    print('ты выжил')
                    k = input('выбери цвет глаз ')
                    if k == 'голубые':
                        print('потрачено')
                    else:
                        print('ты выжил')
                        print('⠰⡿⠿⠛⠛⠻⠿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀')
                        print('  ⠀⠀⠀⠀⣀⣄⡀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣤⣄⣀⡀⠀')
                        print('     ⢸⣿⣿⣷⠀⠀⠀⠀⠀⠛⠛⣿⣿⣿⡛⠿⠷')
                        print('     ⠘⠿⠿⠋⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⠇⠀⠀')
                        print('            ⠀⠀⠀⠀⠀⠀⠈⠉⠁ ⠀⠀⠀')
                        print('       ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀')
                        print('       ⠀⠀⠀⣿⣷⣄⠀⢶⣶⣷⣶⣶⣤⣀ ⠀⠀')
                        print('       ⠀⠀⠀⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠈⠙⠻⠗ ')
                        print('     ⠀⠀⠀⣰⣿⣿⣿⠀⠀⠀⠀⢀⣀⣠⣤⣴⣶⡄⠀')
                        print('   ⠀  ⣠⣾⣿⣿⣿⣥⣶⣶⣿⣿⣿⣿⣿⠿⠿⠛⠃⠀⠀⠀')
                        print('     ⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀')
                        print('     ⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡁ ⠀⠀⠀⠀⠀⠀⠀⠀⠀')
                        print('     ⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁ ⠀⠀⠀⠀⠀⠀⠀⠀⠀')
                        print('   ⠀  ⠛⢿⣿⣿⣿⣿⣿⣿⡿⠟ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀')
                        print('    ⠀⠀⠀⠀⠀⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀')
                        O = input('выбери куда пойдешь работать кофейня дом офис ')
                        if O == 'кофейня':
                            print('ты выжил и пьешь айс лате с карамелью и програмируешь на маке')
                        if O == 'дом':
                            print('ты выжил и сидишь дома и ешь сырки')
                        else:
                            print('ты лох обычный рабочий')
                else:
                    print('потрачено')
            else:
                print('потрачено')
        else:
            print('потрачено')
    else:
        print('потрачено')
else:
    print('потрачено')

print('ты прошел игру ')
